Revit 2027 API
BuiltInFailures.FamilyFailures.CannotLoadImperialFamilyToMetricProject Property
 Can't load an imperial Family into a metric Project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotLoadImperialFamilyToMetricProject { get; }
Public Shared ReadOnly Property CannotLoadImperialFamilyToMetricProject As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotLoadImperialFamilyToMetricProject {
	FailureDefinitionId^ get ();
}
static member CannotLoadImperialFamilyToMetricProject : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace